In [1]:
import pandas as pd

df = pd.read_csv('data/pandas/gapminder.tsv', sep='\t')
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [2]:
df.shape

(1704, 6)

In [5]:
len(df['country'].unique())

142

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [7]:
# year 컬럼 기준으로 값을 묶어준다.
df.groupby('year')['lifeExp'].mean()
# select avg(lifeExp) from df group by year

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [8]:
def my_mean(values):
    n = len(values)
    sum = 0
    for value in values:
        sum += value
    return sum / n

In [10]:
df.groupby('year')['lifeExp'].agg(my_mean)

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [11]:
def my_mean_diff(values, diff_value):
    n = len(values)
    sum = 0
    for value in values:
        sum += value
    mean = sum / n
    return mean - diff_value

In [12]:
global_mean = df['lifeExp'].mean()
print(global_mean)

59.474439366197174

In [13]:
df.groupby('year')['lifeExp'].agg(my_mean_diff, diff_value=global_mean)

year
1952   -10.416820
1957    -7.967038
1962    -5.865190
1967    -3.796150
1972    -1.827053
1977     0.095718
1982     2.058758
1987     3.738173
1992     4.685899
1997     5.540237
2002     6.220483
2007     7.532983
Name: lifeExp, dtype: float64

In [15]:
df.groupby('year')['lifeExp'].mean() - global_mean

year
1952   -10.416820
1957    -7.967038
1962    -5.865190
1967    -3.796150
1972    -1.827053
1977     0.095718
1982     2.058758
1987     3.738173
1992     4.685899
1997     5.540237
2002     6.220483
2007     7.532983
Name: lifeExp, dtype: float64

In [27]:
df.groupby('year')['lifeExp'].agg(['sum', 'size'])

             sum  size
year
1952  6966.18200   142
1957  7314.05096   142
1962  7612.51336   142
1967  7906.31712   142
1972  8185.92888   142
1977  8458.96236   142
1982  8737.71400   142
1987  8976.19100   142
1992  9110.76800   142
1997  9232.08400   142
2002  9328.67900   142
2007  9515.05400   142

In [34]:
df.groupby('year').agg({'lifeExp':['mean', 'sum'], 'pop':'sum'})

        lifeExp                     pop
           mean         sum         sum
year
1952  49.057620  6966.18200  2406957150
1957  51.507401  7314.05096  2664404580
1962  53.609249  7612.51336  2899782974
1967  55.678290  7906.31712  3217478384
1972  57.647386  8185.92888  3576977158
1977  59.570157  8458.96236  3930045807
1982  61.533197  8737.71400  4289436840
1987  63.212613  8976.19100  4691477418
1992  64.160338  9110.76800  5110710260
1997  65.014676  9232.08400  5515204472
2002  65.694923  9328.67900  5886977579
2007  67.007423  9515.05400  6251013179

In [42]:
grouped = df.groupby('year').groups

In [38]:
grouped.keys()

dict_keys([1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, 2002, 2007])

In [39]:
grouped[1952]

Index([   0,   12,   24,   36,   48,   60,   72,   84,   96,  108,
       ...
       1584, 1596, 1608, 1620, 1632, 1644, 1656, 1668, 1680, 1692],
      dtype='int64', length=142)

In [41]:
df.iloc[grouped[1952]]

                 country continent  year  lifeExp       pop    gdpPercap
0            Afghanistan      Asia  1952   28.801   8425333   779.445314
12               Albania    Europe  1952   55.230   1282697  1601.056136
24               Algeria    Africa  1952   43.077   9279525  2449.008185
36                Angola    Africa  1952   30.015   4232095  3520.610273
48             Argentina  Americas  1952   62.485  17876956  5911.315053
...                  ...       ...   ...      ...       ...          ...
1644             Vietnam      Asia  1952   40.412  26246839   605.066492
1656  West Bank and Gaza      Asia  1952   43.160   1030585  1515.592329
1668         Yemen, Rep.      Asia  1952   32.548   4963829   781.717576
1680              Zambia    Africa  1952   42.038   2672000  1147.388831
1692            Zimbabwe    Africa  1952   48.451   3080907   406.884115

[142 rows x 6 columns]

In [44]:
df.groupby('year').get_group(1952)['lifeExp']

0       28.801
12      55.230
24      43.077
36      30.015
48      62.485
         ...
1644    40.412
1656    43.160
1668    32.548
1680    42.038
1692    48.451
Name: lifeExp, Length: 142, dtype: float64

In [46]:
df.groupby('year')['lifeExp'].get_group(1957)

1       30.332
13      59.280
25      45.685
37      31.999
49      64.399
         ...
1645    42.887
1657    45.671
1669    33.970
1681    44.077
1693    50.469
Name: lifeExp, Length: 142, dtype: float64

In [48]:
df.groupby('year')['lifeExp'].count()
df.groupby('year').count()['lifeExp']

year
1952    142
1957    142
1962    142
1967    142
1972    142
1977    142
1982    142
1987    142
1992    142
1997    142
2002    142
2007    142
Name: lifeExp, dtype: int64

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [52]:
# 범주형 : category
df['continent'].unique()

array(['Asia', 'Europe', 'Africa', 'Americas', 'Oceania'], dtype=object)

In [53]:
df.groupby('pop').groups

{60011: [1296], 61325: [1297], 63149: [420], 65345: [1298], 70787: [1299], 71851: [421], 76595: [1300], 86796: [1301], 89898: [422], 98593: [1302], 110812: [1303], 120447: [84], 125911: [1304], 127617: [423], 138655: [85], 145608: [1305], 147962: [684], 153936: [312], 160000: [852], 165110: [685], 170372: [1306], 170928: [313], 171863: [86], 178848: [424], 182053: [686], 191689: [314], 192675: [485], 198676: [687], 199579: [1307], 202182: [87], 209275: [688], 212846: [853], 216964: [480], 217378: [315], 221823: [689], 228694: [425], 230800: [88], 232922: [481], 233997: [690], 244676: [691], 249220: [482], 250027: [316], 257700: [1260], 259012: [692], 259864: [483], 271192: [693], 277603: [484], 284320: [552], 285483: [486], 288030: [694], 290243: [1452], 297410: [89], 301931: [695], 304739: [317], 305991: [426], 308700: [1261], 311025: [427], 323150: [553], 326741: [1453], 341244: [487], 348643: [318], 358266: [854], 358900: [1262], 370006: [1454], 374020: [554], 377967: [90], 384156: [428], 387838: [488], 395114: [319], 413834: [1008], 414024: [1263], 417908: [429], 420690: [1455], 420702: [540], 434904: [541], 439593: [555], 439971: [489], 442308: [156], 442829: [1009], 447416: [430], 454429: [320], 454612: [91], 455661: [542], 461633: [1264], 474528: [1010], 474639: [157], 480105: [1456], 485831: [1056], 489004: [543], 492095: [1265], 495627: [490], 496374: [431], 501035: [1011], 507833: [1152], 512764: [158], 516556: [972], 517101: [556], 517810: [1266], 527678: [1012], 527982: [321], ...}

In [57]:
df['continent'].astype('category')

0         Asia
1         Asia
2         Asia
3         Asia
4         Asia
         ...
1699    Africa
1700    Africa
1701    Africa
1702    Africa
1703    Africa
Name: continent, Length: 1704, dtype: category
Categories (5, object): ['Africa', 'Americas', 'Asia', 'Europe', 'Oceania']

In [65]:
df.groupby(['country', 'year'])['lifeExp'].mean()

country      year
Afghanistan  1952    28.801
             1957    30.332
             1962    31.997
             1967    34.020
             1972    36.088
                      ...
Zimbabwe     1987    62.351
             1992    60.377
             1997    46.809
             2002    39.989
             2007    43.487
Name: lifeExp, Length: 1704, dtype: float64

In [45]:
import pandas as pd
titanic = pd.read_csv('data/pandas/titanic.csv')
titanic.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [38]:
female_age = titanic.groupby(['Sex'])['Age'].mean()['female']
male_age = titanic.groupby(['Sex'])['Age'].mean()['male']

In [89]:
print(female_age)
print(male_age)

27.915708812260537
30.72664459161148

In [89]:
f_age = titanic[titanic['Sex'] == 'female']['Age'].fillna(female_age)
m_age = titanic[titanic['Sex'] == 'male']['Age'].fillna(male_age)

pd.concat([f_age, m_age])

1      38.0
2      26.0
3      35.0
8      27.0
9      14.0
       ...
883    28.0
884    25.0
886    27.0
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [84]:
f_age = titanic[titanic['Sex'] == 'female']['Age'].fillna(female_age)
m_age = titanic[titanic['Sex'] == 'male']['Age'].fillna(male_age)

titanic['Age_fill'] = pd.concat([f_age, m_age])
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_fill
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,22.000000
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,38.000000
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,26.000000
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,35.000000
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,35.000000
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,27.000000
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,19.000000
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,27.915709
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,26.000000
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,32.000000

In [90]:
titanic.groupby(['Pclass', 'Sex'])['Age'].mean()

Pclass  Sex
1       female    34.611765
        male      41.281386
2       female    28.722973
        male      30.740707
3       female    21.750000
        male      26.507589
Name: Age, dtype: float64

In [86]:
pclass = titanic['Pclass'].unique()
sex = titanic['Sex'].unique()
dfs = []
for s in sex:
    for p in pclass:
        mean_age = titanic.groupby(['Pclass', 'Sex'])['Age'].mean()[p, s]
        df = titanic[(titanic['Sex'] == s) & (titanic['Pclass'] == p)]['Age'].fillna(mean_age)
        dfs.append(df)

In [88]:
titanic['P_S_age'] = pd.concat(dfs)
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_fill,P_S_age
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,22.000000,22.00
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,38.000000,38.00
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,26.000000,26.00
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,35.000000,35.00
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,35.000000,35.00
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,27.000000,27.00
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,19.000000,19.00
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,27.915709,21.75
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,26.000000,26.00
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,32.000000,32.00